lkolbly/cmsis-svd/data/TexasInstruments/LM3S601.svd
        <register>
          <name>PBORCTL</name>
          <description>Brown-Out Reset Control</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PBORCTL_BORWT</name>
              <description>BOR Wait and Check for Noise</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PBORCTL_BORIOR</name>
              <description>BOR Interrupt or Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PBORCTL_BORTIM</name>
              <description>BOR Time Delay</description>
              <bitRange>[15:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOPCTL</name>
          <description>LDO Power Control</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_LDOPCTL</name>
              <description>LDO Output Voltage</description>
              <bitRange>[5:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_50V</name>
                  <description>2.50</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_45V</name>
                  <description>2.45</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_40V</name>
                  <description>2.40</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_35V</name>
                  <description>2.35</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_30V</name>
                  <description>2.30</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_25V</name>
                  <description>2.25</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_75V</name>
                  <description>2.75</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_70V</name>
                  <description>2.70</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_65V</name>
                  <description>2.65</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_60V</name>
                  <description>2.60</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_55V</name>
                  <description>2.55</description>
                  <value>0x1f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR0</name>
          <description>Software Reset Control 0</description>
          <addressOffset>0x00000040</addressOffset>
        </register>
        <register>
          <name>SRCR1</name>
          <description>Software Reset Control 1</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR1_UART0</name>
              <description>UART0 Reset Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_UART1</name>
              <description>UART1 Reset Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_SSI0</name>
              <description>SSI0 Reset Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_QEI0</name>
              <description>QEI0 Reset Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_I2C0</name>
              <description>I2C0 Reset Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER0</name>
              <description>Timer 0 Reset Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER1</name>
              <description>Timer 1 Reset Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER2</name>
              <description>Timer 2 Reset Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP0</name>
              <description>Analog Comp 0 Reset Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP1</name>
              <description>Analog Comp 1 Reset Control</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP2</name>
              <description>Analog Comp 2 Reset Control</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR2</name>
          <description>Software Reset Control 2</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR2_GPIOA</name>
              <description>Port A Reset Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOB</name>
              <description>Port B Reset Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOC</name>
              <description>Port C Reset Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOD</name>
              <description>Port D Reset Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOE</name>
              <description>Port E Reset Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Raw Interrupt Status</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RIS_PLLFRIS</name>
              <description>PLL Fault Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_BORRIS</name>
              <description>Brown-Out Reset Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_LDORIS</name>
              <description>LDO Power Unregulated Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_MOFRIS</name>
              <description>Main Oscillator Fault Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_IOFRIS</name>
              <description>Internal Oscillator Fault Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_CLRIS</name>
              <description>Current Limit Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_PLLLRIS</name>
              <description>PLL Lock Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMC</name>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_IMC_PLLFIM</name>
              <description>PLL Fault Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_BORIM</name>
              <description>Brown-Out Reset Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_LDOIM</name>
              <description>LDO Power Unregulated Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_MOFIM</name>
              <description>Main Oscillator Fault Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_IOFIM</name>
              <description>Internal Oscillator Fault Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_CLIM</name>
              <description>Current Limit Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_PLLLIM</name>
              <description>PLL Lock Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MISC_BORMIS</name>
              <description>BOR Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_LDOMIS</name>
              <description>LDO Power Unregulated Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_MOFMIS</name>
              <description>Main Oscillator Fault Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_IOFMIS</name>
              <description>Internal Oscillator Fault Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_CLMIS</name>
              <description>Current Limit Masked Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESC</name>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RESC_EXT</name>
              <description>External Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_POR</name>
              <description>Power-On Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_BOR</name>
              <description>Brown-Out Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_SW</name>
              <description>Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_LDO</name>
              <description>LDO Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
